{
    "format": "graph-model",
    "generatedBy": "2.5.0",
    "convertedBy": "TensorFlow.js Converter v3.0.0",
    "signature": {
        "inputs": {
            "inputs:0": {
                "name": "inputs:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        {
                            "size": "-1"
                        },
                        {
                            "size": "224"
                        },
                        {
                            "size": "224"
                        },
                        {
                            "size": "3"
                        }
                    ]
                }
            }
        },
        "outputs": {
            "Identity:0": {
                "name": "Identity:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        {
                            "size": "-1"
                        },
                        {
                            "size": "1024"
                        }
                    ]
                }
            }
        }
    },
    "modelTopology": {
        "node": [
            {
                "name": "inputs",
                "op": "Placeholder",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "shape": {
                        "shape": {
                            "dim": [
                                {
                                    "size": "-1"
                                },
                                {
                                    "size": "224"
                                },
                                {
                                    "size": "224"
                                },
                                {
                                    "size": "3"
                                }
                            ]
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/Conv/Conv2D_weights",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "16"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/Conv/Conv2D_bn_offset",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "16"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv/depthwise/depthwise_weights",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "16"
                                    },
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv/depthwise/depthwise_bn_offset",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "16"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv_9/project/Conv2D_bn_offset",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "96"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv/project/Conv2D_weights",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "16"
                                    },
                                    {
                                        "size": "16"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv_10/expand/Conv2D_weights",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "96"
                                    },
                                    {
                                        "size": "576"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv/project/Conv2D_bn_offset",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "16"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv_1/expand/Conv2D_weights",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "16"
                                    },
                                    {
                                        "size": "72"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv_1/expand/Conv2D_bn_offset",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "72"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv_10/expand/Conv2D_bn_offset",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "576"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv_1/depthwise/depthwise_weights",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "72"
                                    },
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv_1/depthwise/depthwise_bn_offset",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "72"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv_1/project/Conv2D_weights",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "72"
                                    },
                                    {
                                        "size": "24"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv_1/project/Conv2D_bn_offset",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "24"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv_2/expand/Conv2D_weights",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "24"
                                    },
                                    {
                                        "size": "88"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv_2/expand/Conv2D_bn_offset",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "88"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv_2/depthwise/depthwise_weights",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "88"
                                    },
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv_2/depthwise/depthwise_bn_offset",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "88"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv_2/project/Conv2D_weights",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "88"
                                    },
                                    {
                                        "size": "24"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv_2/project/Conv2D_bn_offset",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "24"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv_3/expand/Conv2D_weights",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "24"
                                    },
                                    {
                                        "size": "96"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv_3/expand/Conv2D_bn_offset",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "96"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv_3/depthwise/depthwise_weights",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "5"
                                    },
                                    {
                                        "size": "5"
                                    },
                                    {
                                        "size": "96"
                                    },
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv_3/depthwise/depthwise_bn_offset",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "96"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv_10/depthwise/depthwise_weights",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "5"
                                    },
                                    {
                                        "size": "5"
                                    },
                                    {
                                        "size": "576"
                                    },
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv_10/depthwise/depthwise_bn_offset",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "576"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv_3/project/Conv2D_weights",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "96"
                                    },
                                    {
                                        "size": "40"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv_3/project/Conv2D_bn_offset",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "40"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv_4/expand/Conv2D_weights",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "40"
                                    },
                                    {
                                        "size": "240"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv_4/expand/Conv2D_bn_offset",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "240"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv_4/depthwise/depthwise_weights",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "5"
                                    },
                                    {
                                        "size": "5"
                                    },
                                    {
                                        "size": "240"
                                    },
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv_4/depthwise/depthwise_bn_offset",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "240"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv_4/project/Conv2D_weights",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "240"
                                    },
                                    {
                                        "size": "40"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv_4/project/Conv2D_bn_offset",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "40"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv_5/expand/Conv2D_weights",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "40"
                                    },
                                    {
                                        "size": "240"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv_5/expand/Conv2D_bn_offset",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "240"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv_5/depthwise/depthwise_weights",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "5"
                                    },
                                    {
                                        "size": "5"
                                    },
                                    {
                                        "size": "240"
                                    },
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv_5/depthwise/depthwise_bn_offset",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "240"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv_5/project/Conv2D_weights",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "240"
                                    },
                                    {
                                        "size": "40"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv_5/project/Conv2D_bn_offset",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "40"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv_6/expand/Conv2D_weights",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "40"
                                    },
                                    {
                                        "size": "120"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv_6/expand/Conv2D_bn_offset",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "120"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv_6/depthwise/depthwise_weights",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "5"
                                    },
                                    {
                                        "size": "5"
                                    },
                                    {
                                        "size": "120"
                                    },
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv_6/depthwise/depthwise_bn_offset",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "120"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv_6/project/Conv2D_weights",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "120"
                                    },
                                    {
                                        "size": "48"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv_10/project/Conv2D_weights",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "576"
                                    },
                                    {
                                        "size": "96"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv_6/project/Conv2D_bn_offset",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "48"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/StatefulPartitionedCall/predict/MobilenetV3/expanded_conv_7/expand/Conv2D_weights",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "48"
                                    },
                                    {
                                        "size": "144"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
